rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Goodfellas"], ["rating", "R"], ["director", "Martin Scorsese"], ["created_at", "2018-10-06 22:26:14.778651"], ["updated_at", "2018-10-06 22:26:14.778651"]]

  def same_directors
    id = params[:id]
    @movie = Movie.find(id)
    if @movie.director == nil || ""
      redirect_to movies_path
      flash[:notice] = "'#{@movie.title}' has no director info"
    else
     flash[:notice] = "Showing movies with the same director as #{@movie.title}."
     @movies = Movie.where(director: @movie.director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Alfred"]]